DistributedDataParallel(
  (module): YearProcessor(
    (inner): CustomTransformer(
      (pre_conv): Sequential(
        (0): Conv1d(65, 1024, kernel_size=(1,), stride=(1,))
        (1): PReLU(num_parameters=1)
        (2): Conv1d(1024, 384, kernel_size=(1,), stride=(1,))
        (3): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
      (pos_enc): PositionalEncoding(
        (dropout): Dropout(p=0.1, inplace=False)
      )
      (transformer): TransformerEncoder(
        (layers): ModuleList(
          (0-3): 4 x TransformerEncoderLayer(
            (self_attn): MultiheadAttention(
              (out_proj): NonDynamicallyQuantizableLinear(in_features=128, out_features=128, bias=True)
            )
            (linear1): Linear(in_features=128, out_features=512, bias=True)
            (dropout): Dropout(p=0.1, inplace=False)
            (linear2): Linear(in_features=512, out_features=128, bias=True)
            (norm1): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
            (norm2): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
            (dropout1): Dropout(p=0.1, inplace=False)
            (dropout2): Dropout(p=0.1, inplace=False)
          )
        )
      )
      (post_conv): Sequential(
        (0): Conv1d(128, 256, kernel_size=(1,), stride=(1,))
        (1): PReLU(num_parameters=1)
        (2): Conv1d(256, 15, kernel_size=(1,), stride=(1,))
      )
    )
  )
)